<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Identifier</key>
    <string>com.github.jaltonen-recipes.download.twine</string>
    <key>Description</key>
    <string>Downloads the latest version of twine</string>


	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Twine</string>
	</dict>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>asset_regex</key>
				<string>^.*-macOS\.dmg$</string>
				<key>github_repo</key>
				<string>klembot/twinejs</string>
			</dict>
			<key>Processor</key>
			<string>GitHubReleasesInfoProvider</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%url%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
	        <dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>

	<dict>
            <key>Processor</key>
            <string>InstallFromDMG</string>
            <key>Arguments</key>
            <dict>
                <key>dmg_path</key>
                <string>%pathname%</string>
                <key>items_to_copy</key>
                <array>
                    <dict>
                        <key>source_item</key>
                        <string>Twine.app</string>
                        <key>destination_path</key>
                        <string>%RECIPE_CACHE_DIR%</string>
                    </dict>
                </array>
            </dict>
        </dict>



</array>
</dict>
</plist>
