<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Identifier</key>
    <string>com.github.jaltonen-recipes.munki.Twine</string>
    <key>Description</key>
    <string>Imports the Twine app into the repo</string>
    <key>Input</key>
    <dict>
 
        <key>NAME</key>
        <string>Twine</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/Twine</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>production</string>
            </array>
            <key>description</key>
            <string>This software installs the latest version of Twine.</string>
            <key>display_name</key>
            <string>Twine</string>
            <key>minimum_os_version</key>
            <string>11.0.0</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>uninstallable</key>
            <true/>
        </dict>
    </dict>


   <key>ParentRecipe</key>
    <string>com.github.jaltonen-recipes.download.twine</string>
    <key>Process</key>
    <array>
       

		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>

</dict>
</plist>
