<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string></string>
    <key>Identifier</key>
    <string>com.github.jaltonen.munki.dcp-o-matic-batch</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>dcp-o-matic-batch</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/dcp-o-matic-batch</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>production</string>
            </array>
            <key>description</key>
        	<string>dcp-o-matic-batch</string>
            <key>display_name</key>
            <string>%NAME%</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>2.0.0</string>
    <key>ParentRecipe</key>
	<string>com.github.jaltonen-recipes.download.DCP-o-matic-batch</string>
    <key>Process</key>
	<array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/Downloads/batch.dmg</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
             
    </array>
</dict>
</plist>