<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of DCP-o-matic server.</string>
    <key>Identifier</key>
    <string>com.github.jaltonen-recipes.download.DCP-o-matic 2 server</string>
    <key>MinimumVersion</key>
    <string>1.1</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>DCP-o-matic2-server</string>
    </dict>
    <key>Process</key>
    <array>
        
        <dict>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <!-- <string>href=\"/(dl\.php\?id=osx-([0-9]+(\.[0-9]+)+)-server&amp;version=([0-9]+(\.[0-9]+)+))\">Encode Server</string> -->
                <string><a\s+href="\/dl\?id=osx-10\.10-server&amp;version=\d+\.\d+\.\d+"></string>
                <key>url</key>
                <string>https://dcpomatic.com/download</string>
            </dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>server.dmg</string>
                <key>url</key>
                <string>https://dcpomatic.com/%match%</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        
        
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>