<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>munkis dragonframe2024
</string>
    <key>Identifier</key>
    <string>com.github.jaltonen.munki.dragonFrame2024</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>dragonframe2024</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/%NAME%</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>production</string>
            </array>
            <key>description</key>
            <string></string>
            <key>display_name</key>
            <string>DragonFrame2024</string>
            <key>minimum_os_version</key>
            <string>10.11.6</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>uninstallable</key>
            <true/>
            <key>uninstall_method</key>
            <string>uninstall_script</string>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>ParentRecipe</key>
    <string>com.github.jaltonen-recipes.pkg.Dragonframe2024</string>
    <key>Process</key>
    <array>
    
        <dict>
            <key>Processor</key>
            <string>FileFinder</string>
            <key>Arguments</key>
            <dict>
                <key>pattern</key>
                <string>%RECIPE_CACHE_DIR%/*.pkg</string>
            </dict>
        </dict>
    
    
    
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%found_filename%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
