<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple Computer//DTD PLIST 1.0//EN"
   "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>

  <key>Identifier</key>
   <string>com.github.jaltonen-recipes.macos-sonoma-full-installer.download</string>

  <key>Description</key>
  <string>Downloads the latest macOS Sonoma full installer directly from Apple as listed on MrMacintosh.com.</string>

  <key>Input</key>
  <dict>
    <key>search_url</key>
    <string>https://mrmacintosh.com/macos-sonoma-full-installer-database-download-directly-from-apple/</string>
    <key>pkg_link_regex</key>
    <string>https:\/\/swcdn\.apple\.com\/content\/downloads\/[0-9A-Z\-\.]+\/InstallAssistant\.pkg</string>
  </dict>

  <key>Process</key>
  <array>

    <!-- Scrape the page for the Apple CDN URL -->
    <dict>
      <key>Processor</key>
      <string>URLTextSearcher</string>
      <key>Arguments</key>
      <dict>
        <key>url</key>
        <string>%search_url%</string>
        <key>re_pattern</key>
        <string>%pkg_link_regex%</string>
        <key>findall</key>
        <false/>
      </dict>
    </dict>

    <!-- Download the found PKG -->
    <dict>
      <key>Processor</key>
      <string>URLDownloader</string>
      <key>Arguments</key>
      <dict>
        <key>url</key>
        <string>%RE_URL%</string>
        <key>download_path</key>
        <string>%RECIPE_CACHE_DIR%</string>
        <key>filename</key>
        <string>InstallAssistant_Sonoma.pkg</string>
      </dict>
    </dict>

  </array>

  <key>Output</key>
  <dict>
    <key>url</key>
    <string>%RE_URL%</string>
    <key>download_path</key>
    <string>%RECIPE_CACHE_DIR%/InstallAssistant_Sonoma.pkg</string>
  </dict>

</dict>
</plist>
