<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Identifier</key>
    <string>com.github.jaltonen-recipes.download.inform</string>
    <key>Description</key>
    <string>Downloads the latest version of inform</string>


	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Inform</string>
	</dict>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>asset_regex</key>
				<string>^.*macOS*\.dmg$</string>
				<key>github_repo</key>
				<string>ganelson/inform</string>
			</dict>
			<key>Processor</key>
			<string>GitHubReleasesInfoProvider</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%url%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
	        <dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
                </dict>

</array>
</dict>
</plist>
