<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the most recent version of DaVinci Resolve Studio 18 and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.github.jaltonen.munki.davinciResolveStudio18v2</string>
    <key>Input</key>
    <dict>
 
        <key>NAME</key>
        <string>DaVinciResolveStudio18</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/DaVinciResolveStudio18V2</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>production</string>
            </array>
            <key>description</key>
            <string>This software installs DaVinci Resolve Studio 18.</string>
            <key>display_name</key>
            <string>DaVinci Resolve Studio 18</string>
            <key>minimum_os_version</key>
            <string>11.0.0</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>uninstallable</key>
            <true/>
            <key>uninstall_method</key>
            <string>uninstall_script</string>
            <key>uninstall_script</key>
            <string>#!/bin/sh
            # Run the uninstaller script provided with the app.
            # Alternatively, replace this with your own version of their uninstaller.
            # For example, their uninstaller intentionally leaves the following on the
            # system, which you may disagree with:
            # - /Library/Application Support/Blackmagic Design/DaVinci Resolve
            # - /Library/Preferences/Blackmagic Design/DaVinci Resolve
            #
            # Their uninstaller is also executable and world-writable.

            UNINSTALL_SCRIPT="/Applications/DaVinci Resolve/Uninstall Resolve.app/Contents/Resources/uninstall.sh"

            [ -x "${UNINSTALL_SCRIPT}" ] || exit 1
            "${UNINSTALL_SCRIPT}"
            </string>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>ParentRecipe</key>
    <string>com.github.jaltonen.download.davinciResolveStudio18</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/unzip</string>
                <key>purge_destination</key>
                <true/>
            </dict>
        </dict>
        
        
    <dict>
            <key>Processor</key>
            <string>FileFinder</string>
            <key>Arguments</key>
            <dict>
                <key>pattern</key>
                <string>%RECIPE_CACHE_DIR%/unzip/*.dmg</string>
            </dict>
        </dict>



    <dict>
      <key>Processor</key>
      <string>PkgCopier</string>
      <key>Arguments</key>
      <dict>
        <key>source_pkg</key>
	    <string>%found_filename%/*.pkg</string>
      </dict>
    </dict>


       <dict>
            <key>Processor</key>
            <string>FileFinder</string>
            <key>Arguments</key>
            <dict>
                <key>pattern</key>
                <string>%RECIPE_CACHE_DIR%/*.pkg</string>
            </dict>
        </dict>

         <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%found_filename%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
              <!--   <key>force_munkiimport</key>
			<string>true</string> -->
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>



       <dict>
            <key>Processor</key>
            <string>MunkiOptionalReceiptEditor</string>
            <key>Arguments</key>
            <dict>
                <key>pkginfo_repo_path</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
		<key>pkg_ids_set_optional_true</key>
                <string>com.blackmagic-design.ManifestFairlightAudioAccelerator</string>
            </dict>
        </dict>



    </array>
</dict>
</plist>
