<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest version of DaVinci Resolve 18.

This product requires registration in order to download, so
you _must_ override all input variables beginning with 'REG_'
and they must contain data.

Notably, REG_COUNTRY must contain sane values:
- REG_COUNTRY is of the form 'us', 'ca', etc.
</string>
    <key>Identifier</key>
    <string>com.github.jaltonen.download.davinciresolve18</string>
    <key>Input</key>
    <dict>
        <!-- Version 14 updates _may_ contain 'Update' in the title, but
        we also want to avoid capturing the 'Studio Update' versions -->
        <key>PRODUCT_NAME_PATTERN</key>
        <string>^DaVinci Resolve (?P&lt;version&gt;18(\.\d+)*)( Update)*$</string>
        <key>NAME</key>
        <string>DaVinciResolve18</string>
        <key>REG_FIRSTNAME</key>
        <string>VCU</string>
        <key>REG_LASTNAME</key>
        <string>arts</string>
        <key>REG_EMAIL</key>
        <string>arthelp@vcu.edu</string>
        <key>REG_PHONE</key>
        <string>8048287045</string>
        <key>REG_CITY</key>
        <string>Richmond</string>
        <key>REG_COUNTRY</key>
        <string>us</string>
    </dict>
    <key>MinimumVersion</key>
    <string>2.0.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>BlackMagicURLProvider</string>
            <key>Arguments</key>
            <dict>
                <key>product_name_pattern</key>
                <string>%PRODUCT_NAME_PATTERN%</string>
                <key>product_name</key>
                <string>DaVinci Resolve</string>
                <key>registration_info</key>
                <dict>
                    <key>firstname</key>
                    <string>%REG_FIRSTNAME%</string>
                    <key>lastname</key>
                    <string>%REG_LASTNAME%</string>
                    <key>email</key>
                    <string>%REG_EMAIL%</string>
                    <key>phone</key>
                    <string>%REG_PHONE%</string>
                    <key>city</key>
                    <string>%REG_CITY%</string>
                    <key>country</key>
                    <string>%REG_COUNTRY%</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%-%version%.zip</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>