<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Silhouette Studio.</string>
	<key>Identifier</key>
	<string>com.github.ahousseini-recipes.download.SilhouetteStudio</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Silhouette Studio</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<!-- ><string>href=\"(https://d62nvtdcnsm38\.cloudfront\.net/files/softwares/ss/SS_V\d+(?:\.\d+)+_M6R[_0-9]*\.dmg)\" class=\"secondary-btn mac</string> -->
				<string><href="https://medias3.silhouettedesignstore.com/files/softwares/ss/SS_V\d+(?:\.\d+)+_M6R[_0-9]*\.dmg"</string>
				<key>request_headers</key>
				<dict>
					<key>user-agent</key>
					<string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/16.1 Safari/605.1.15</string>
				</dict>
				<key>result_output_var_name</key>
				<string>url</string>
				<key>url</key>
				<string>https://www.silhouetteamerica.com/software/legacy/id/3</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
				<key>request_headers</key>
				<dict>
					<key>user-agent</key>
					<string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/16.1 Safari/605.1.15</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/Silhouette Studio.app</string>
				<key>requirement</key>
				<string>identifier "com.silhouettesoftware.Silhouette-Studio" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = TAX3B9PB9G</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%pathname%/Silhouette Studio.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleShortVersionString</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
	</array>
</dict>
</plist>