<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download the latest version of Silhouette Studio and imports it into Munki.</string>
    <key>Identifier</key>
    <string>com.github.jaltonen.munki.SilhouetteStudio</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/silhouettestudio</string>
        <key>NAME</key>
        <string>Silhouette Studio</string>
    	<key>pkginfo</key>
    	<dict>
    		<key>catalogs</key>
    		<array>
    			<string>production</string>
    		</array>
            <key>display_name</key>
            <string>%NAME%</string>
            <key>category</key>
            <string>Multimedia</string>
            <key>developer</key>
            <string>Silhouette America, Inc.</string>
    		<key>description</key>
    		<string>Create designs and send to a Silhouette machine. This is the free basic version of this software.</string>
    		<key>name</key>
    		<string>%NAME%</string>
            <key>postinstall_script</key>
            <string>#!/bin/sh
# Create necessary directories for non admins to run Silhouette Studio
# Suggested from JCSmillie https://github.com/JCSmillie
# Created in recipe March 19, 2021

# Make Directories
/bin/mkdir "/Library/Application Support/com.aspexsoftware.Silhouette_Studio"
/bin/mkdir "/Library/Application Support/com.aspexsoftware.Silhouette_Studio.license"
# Give all users access
/bin/chmod -R 777 "/Library/Application Support/com.aspexsoftware.Silhouette_Studio"
/bin/chmod -R 777 "/Library/Application Support/com.aspexsoftware.Silhouette_Studio.license"
            </string>
    		<key>unattended_install</key>
    		<true/>
    	</dict>
    </dict>
    <key>MinimumVersion</key>
    <string>2.0.0</string>
    <key>ParentRecipe</key>
    <string>com.github.jaltonen.download.SilhouetteStudio</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
